n = 15;

% Последовательность на основе которой кодируется 
X = [-1 -1 -1 -1 1 -1 1 -1 -1 1 -1 1 1 1 -1];

% Создание матрицы коэффициентов корреляции
H = zeros(n, n);
for i = 1: n
    for j = 1: n
        H(i, j) = X(1, j);
    end
    X = circshift(X, -1);
end

% Транспонирование вектора X 
X = X';

% Автокорреляционная функция (сама с собой)
R = (1/n) * (H * X);

% График автокорреляции последовательности X
pl = plot(R,'LineStyle','none','Marker','square','MarkerFaceColor','auto');


Z1 = [-1 -1 -1 -1 1 1 1 -1 -1 1 -1 1 1 1 -1];

% Транспонирование вектора Z1
Z1 = Z1';   

% Взаимная корреляция векторов X и Z1 (2 векторов)
Y1 = (1 / n) * (H * Z1);

% График взаимной корреляции последовательностей X и Z1
pl1 = plot(Y1,'LineStyle','none','Marker','square','MarkerFaceColor','auto');
max1 = find(Y1 == max(Y1));
E1 = mod((Z1' - H(max1, :)) / 2, 2); 

Z2 = [1 -1 -1 -1 1 -1 1 -1 -1 1 1 1 1 1 -1];
Z2 = Z2';
Y2 = (1 / n) * (H * Z2);

pl2 = plot(Y1,'LineStyle','none','Marker','square','MarkerFaceColor','auto');

max2 = find(Y2 == max(Y2));
E2 = mod((Z2' - H(max2, :)) / 2, 2); 

% E1 = [0,0,0,0,0,1,0,0,0,0,0,0,0,0,0]
% E2 = [1,0,0,0,0,0,0,0,0,0,1,0,0,0,0]